# Find the movie which has maximum net profit in IMDB Movie Database.
# Print the movie name.
# Note: Net Profit= Total Earning(Domestic+WorldWide earning) - budget

In [20]:
import pandas as pd
pd.options.mode.chained_assignment = None  # default='warn'
import sqlite3
db=sqlite3.connect("IMDB.sqlite")
cur=db.cursor()

In [21]:
df=pd.read_sql_query("select Title,Rating,Budget,Domestic,Worldwide from IMDB join earning on IMDB.Movie_id=earning.Movie_id",db)
df.head()
df.dtypes
df1=df.copy()

In [24]:
final_df=df1[df1["Budget"]!=""]
final_df["Net"]=final_df["Domestic"]+final_df["Worldwide"]-final_df["Budget"]
final_df.head()

,Title,Rating,Budget,Domestic,Worldwide,Net
0,12 Years a Slave (2013),8.1,20000000.0,56671993,187733202.0,224405195.0
1,127 Hours (2010),7.6,18000000.0,18335230,60738797.0,61074027.0
2,50/50 (2011),7.7,8000000.0,35014192,39187783.0,66201975.0
3,About Time (2013),7.8,12000000.0,15322921,87100449.0,90423370.0
4,Amour (2012),7.9,8900000.0,6739492,19839492.0,17678984.0

In [23]:
# Answer
ans=final_df["Net"].max()
final_df[final_df["Net"]==ans]

,Title,Rating,Budget,Domestic,Worldwide,Net
79,Star Wars: The Force Awakens (2015),8.1,245000000.0,936662225,2.068224e+09,2759885849.0